Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM241.svd
        <register>
          <name>DMAEN</name>
          <description>DMAEN register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN0</name>
              <description>PIN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>PIN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>PIN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>PIN3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>PIN4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>PIN5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>PIN6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>PIN7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>PIN8 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>PIN9 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>PIN10 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>PIN11 field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>PIN12 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>PIN13 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>PIN14 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>PIN15 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>IDR register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIN0</name>
              <description>PIN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN1</name>
              <description>PIN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN2</name>
              <description>PIN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN3</name>
              <description>PIN3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN4</name>
              <description>PIN4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN5</name>
              <description>PIN5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN6</name>
              <description>PIN6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN7</name>
              <description>PIN7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN8</name>
              <description>PIN8 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN9</name>
              <description>PIN9 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN10</name>
              <description>PIN10 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN11</name>
              <description>PIN11 field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN12</name>
              <description>PIN12 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN13</name>
              <description>PIN13 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN14</name>
              <description>PIN14 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN15</name>
              <description>PIN15 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAPIN0</name>
          <description>DATAPIN0 register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN1</name>
          <description>DATAPIN1 register</description>
          <addressOffset>0x000044</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN2</name>
          <description>DATAPIN2 register</description>
          <addressOffset>0x000048</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN3</name>
          <description>DATAPIN3 register</description>
          <addressOffset>0x00004C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN4</name>
          <description>DATAPIN4 register</description>
          <addressOffset>0x000050</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN5</name>
          <description>DATAPIN5 register</description>
          <addressOffset>0x000054</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN6</name>
          <description>DATAPIN6 register</description>
          <addressOffset>0x000058</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN7</name>
          <description>DATAPIN7 register</description>
          <addressOffset>0x00005C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN8</name>
          <description>DATAPIN8 register</description>
          <addressOffset>0x000060</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN9</name>
          <description>DATAPIN9 register</description>
          <addressOffset>0x000064</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN10</name>
          <description>DATAPIN10 register</description>
          <addressOffset>0x000068</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN11</name>
          <description>DATAPIN11 register</description>
          <addressOffset>0x00006C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN12</name>
          <description>DATAPIN12 register</description>
          <addressOffset>0x000070</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN13</name>
          <description>DATAPIN13 register</description>
          <addressOffset>0x000074</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN14</name>
          <description>DATAPIN14 register</description>
          <addressOffset>0x000078</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DATAPIN15</name>
          <description>DATAPIN15 register</description>
          <addressOffset>0x00007C</addressOffset>
          <access>read-write</access>
        </register>
