Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM241.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR1</name>
      <baseAddress>0x40046840</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR2</name>
      <baseAddress>0x40046880</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR3</name>
      <baseAddress>0x400468C0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR4</name>
      <baseAddress>0x40046900</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR5</name>
      <baseAddress>0x40046940</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR6</name>
      <baseAddress>0x40046980</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIMR0">
      <name>TIMR7</name>
      <baseAddress>0x400469C0</baseAddress>
    </peripheral>
    <peripheral>
      <name>TIMRG</name>
      <description>Registers group</description>
      <groupName>TIMRG</groupName>
      <baseAddress>0x40046C00</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000044</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>HALLIE</name>
          <description>HALLIE register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HALLIF</name>
          <description>HALLIF register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN0</name>
              <description>IN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN1</name>
              <description>IN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN2</name>
              <description>IN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HALLEN</name>
          <description>HALLEN register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HALLDR</name>
          <description>HALLDR register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HALLSR</name>
          <description>HALLSR register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN0</name>
              <description>IN0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN1</name>
              <description>IN1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN2</name>
              <description>IN2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>EN register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIMR0</name>
              <description>TIMR0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR1</name>
              <description>TIMR1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR2</name>
              <description>TIMR2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR3</name>
              <description>TIMR3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR4</name>
              <description>TIMR4 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR5</name>
              <description>TIMR5 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR6</name>
              <description>TIMR6 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR7</name>
              <description>TIMR7 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
