Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM241.svd
        <register>
          <name>CTRL3</name>
          <description>CTRL3 register</description>
          <addressOffset>0x0001A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>REFPSEL</name>
              <description>REFPSEL field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV0</name>
              <description>CLKDIV0 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGMSK</name>
          <description>TRGMSK register</description>
          <addressOffset>0x0001B0</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CALIBSET</name>
          <description>CALIBSET register</description>
          <addressOffset>0x0001F4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>OFFSET field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>K</name>
              <description>K field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIBEN</name>
          <description>CALIBEN register</description>
          <addressOffset>0x0001F8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>OFFSET field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>K</name>
              <description>K field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM0</name>
      <description>Registers group</description>
      <groupName>PWM</groupName>
      <baseAddress>0x40046000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000040</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODE</name>
          <description>MODE register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERA</name>
          <description>PERA register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HIGHA</name>
          <description>HIGHA register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DZA</name>
          <description>DZA register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PERB</name>
          <description>PERB register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>HIGHB</name>
          <description>HIGHB register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DZB</name>
          <description>DZB register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>OUTCR</name>
          <description>OUTCR register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>INIA</name>
              <description>INIA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INIB</name>
              <description>INIB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVA</name>
              <description>INVA field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVB</name>
              <description>INVB field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEA</name>
              <description>IDLEA field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLEB</name>
              <description>IDLEB field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVAN</name>
              <description>INVAN field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVBN</name>
              <description>INVBN field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADTRGA0</name>
          <description>ADTRGA0 register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADTRGA1</name>
          <description>ADTRGA1 register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BRKEN</name>
          <description>BRKEN register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S0</name>
              <description>S0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1</name>
              <description>S1 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2</name>
              <description>S2 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>OUT field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUEA</name>
          <description>VALUEA register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>VALUEB</name>
          <description>VALUEB register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADTRGB0</name>
          <description>ADTRGB0 register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADTRGB1</name>
          <description>ADTRGB1 register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADTRGDIR</name>
          <description>ADTRGDIR register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>A0DEC</name>
              <description>A0DEC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A0INC</name>
              <description>A0INC field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A1DEC</name>
              <description>A1DEC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A1INC</name>
              <description>A1INC field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B0DEC</name>
              <description>B0DEC field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B0INC</name>
              <description>B0INC field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B1DEC</name>
              <description>B1DEC field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>B1INC</name>
              <description>B1INC field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
