Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM241.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SLCD</name>
      <description>Registers group</description>
      <groupName>SLCD</groupName>
      <baseAddress>0x400A9800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000020</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DRIVEN</name>
              <description>DRIVEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANEN</name>
              <description>SCANEN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISP</name>
              <description>DISP field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIAS</name>
              <description>BIAS field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY</name>
              <description>DUTY field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFRQ</name>
              <description>SCANFRQ field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVSEL</name>
              <description>DRIVSEL field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYSCAN</name>
              <description>KEYSCAN field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA[%s]</name>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <description>DATA register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SLED</name>
      <description>Registers group</description>
      <groupName>SLED</groupName>
      <baseAddress>0x400AA800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000030</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUTY</name>
              <description>DUTY field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMINV</name>
              <description>COMINV field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>CLKDIV register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>TIM</name>
          <description>TIM register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>PERIOD field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGH</name>
              <description>HIGH field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA[%s]</name>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <description>DATA register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SAFETY</name>
      <description>Registers group</description>
      <groupName>SAFETY</groupName>
      <baseAddress>0x400AB000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000040</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PERWP</name>
          <description>PERWP register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IAADEN</name>
              <description>IAADEN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IER</name>
              <description>IER field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOCFGR</name>
              <description>IOCFGR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKCFGR</name>
              <description>CLKCFGR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANACFGR</name>
              <description>ANACFGR field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMWP</name>
          <description>RAMWP register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIZE</name>
              <description>SIZE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>ADDR field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IAACR</name>
          <description>IAACR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>R0INT</name>
              <description>R0INT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R1INT</name>
              <description>R1INT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R2INT</name>
              <description>R2INT field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R3INT</name>
              <description>R3INT field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>R0</name>
              <description>R0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>R1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>R2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>R3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>R0</name>
              <description>R0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R1</name>
              <description>R1 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R2</name>
              <description>R2 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>R3</name>
              <description>R3 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>REGION0</name>
          <description>register cluster</description>
          <addressOffset>0x000020</addressOffset>
          <register>
            <name>BADDR</name>
            <description>BADDR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>TADDR</name>
            <description>TADDR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>REGION1</name>
          <description>register cluster</description>
          <addressOffset>0x000028</addressOffset>
          <register>
            <name>BADDR</name>
            <description>BADDR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>TADDR</name>
            <description>TADDR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>REGION2</name>
          <description>register cluster</description>
          <addressOffset>0x000030</addressOffset>
          <register>
            <name>BADDR</name>
            <description>BADDR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>TADDR</name>
            <description>TADDR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>REGION3</name>
          <description>register cluster</description>
          <addressOffset>0x000038</addressOffset>
          <register>
            <name>BADDR</name>
            <description>BADDR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>TADDR</name>
            <description>TADDR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>
